/* Search criteria for other date properties of a file, such as when a photograph was taken, within a specific period before today */
"%@ %[Any Date]@" = "%1$@ %2$[Cualquier fecha]@";
"%@ %[Today]@" = "%1$@ %2$[Hoy]@";
"%@ %[Since Yesterday]@" = "%1$@ %2$[Desde ayer]@";
"%@ %[This week]@" = "%1$@ %2$[Esta semana]@";
"%@ %[Within Last 2 weeks]@" = "%1$@ %2$[En las dos últimas semanas]@";
"%@ %[This month]@" = "%1$@ %2$[Este mes]@";
"%@ %[Within Last 2 months]@" = "%1$@ %2$[En los dos últimos meses]@";

/* Search criteria for other boolean properties of a file, such as whether red-eye correction was on */
"%@ %[Any]@" = "%1$@ %2$[Cualquiera]@";
"%@ %[Yes]@" = "%1$@ %2$[Sí]@";
"%@ %[No]@" = "%1$@ %2$[No]@";

/* Search criteria for other string properties of a file, such as the name of the author */
"%@ %[Contains]@ %@" = "%1$@ %2$[Contiene]@ %3$@";
"%@ %[Begins With]@ %@" = "%1$@ %2$[Empieza por]@ %3$@";
"%@ %[Ends With]@ %@" = "%1$@ %2$[Termina por]@ %3$@";
"%@ %[Is]@ %@" = "%1$@ %2$[Is]@ %3$@";

/* Search criteria for other date properties of a file, such as when a photograph was taken, on a specific date */
"%@ %[Exactly]@ %@" = "%1$@ %2$[Exactamente]@ %3$@";
"%@ %[Before]@ %@" = "%1$@ %2$[Antes de]@ %3$@";
"%@ %[After]@ %@" = "%1$@ %2$[Después de]@ %3$@";

/* Search criteria for other numerical properties of a file, such as the pixel height of an image */
"%@ %[Greater than]@ %@" = "%1$@ %2$[Superior a]@ %3$@";
"%@ %[Less than]@ %@" = "%1$@ %2$[Inferior a]@ %3$@";

/* Search criteria for other date properties of a file, such as when a photograph was taken, within a user-specified period of time before today */
"%@ %[Within Last]@ %@ %[Days]@" = "%1$@ %2$[En los últimos]@ %3$@ %4$[Días]@";
"%@ %[Within Last]@ %@ %[Weeks]@" = "%1$@ %2$[En los últimos]@ %3$@ %4$[Semanas]@";
"%@ %[Within Last]@ %@ %[Months]@" = "%1$@ %2$[En los últimos]@ %3$@ %4$[Meses]@";
"%@ %[Within Last]@ %@ %[Years]@" = "%1$@ %2$[En los últimos]@ %3$@ %4$[Años]@";

/* Search criteria for other color space properties of a file */
"%[Color Space]@ %[Any Color Space]@" = "%1$[Espacio de color]@ %2$[Cualquier espacio de color]@";
"%[Color Space]@ %[RGB]@" = "%1$[Espacio de color]@ %2$[RGB]@";
"%[Color Space]@ %[CMYK]@" = "%1$[Espacio de color]@ %2$[CMYK]@";
"%[Color Space]@ %[Grayscale]@" = "%1$[Espacio de color]@ %2$[Escala de grises]@";

/* Search criteria for files by contents */
"%[Contents]@ contain %@" = "%1$[Contenido]@ contienen %2$@";

/* Search criteria for time duration - minutes and seconds */
"%[Duration]@ %[Greater than]@ %@ %[min]@ %@ %[sec]@" = "%1$[Duración]@ %2$[Superior a]@ %3$@ %4$[min.]@ %5$@ %6$[seg.]@";
"%[Duration]@ %[Less than]@ %@ %[min]@ %@ %[sec]@" = "%1$[Duración]@ %2$[Inferior a]@ %3$@ %4$[min.]@ %5$@ %6$[seg.]@";

/* Search criteria for files by keyword */
"%[Keywords]@ %@" = "%1$[Palabras clave]@ %2$@";

/* Search criteria for files by keyword containing */
"%[Keywords]@ contain %@" = "%1$[Palabras clave]@ contienen %2$@";

/* Search criteria for specific kinds of files */
"%[Kind]@ is %[Any]@" = "%1$[Clase]@ es %2$[Cualquiera]@";
"%[Kind]@ is %[Images]@" = "%1$[Clase]@ es %2$[Imágenes]@";
"%[Kind]@ is %[Text]@" = "%1$[Clase]@ es %2$[Texto]@";
"%[Kind]@ is %[PDF]@" = "%1$[Clase]@ es %2$[PDF]@";
"%[Kind]@ is %[Movies]@" = "%1$[Clase]@ es %2$[Películas]@";
"%[Kind]@ is %[Music]@" = "%1$[Clase]@ es %2$[Música]@";
"%[Kind]@ is %[Documents]@" = "%1$[Clase]@ es %2$[Documentos]@";
"%[Kind]@ is %[Presentations]@" = "%1$[Clase]@ es %2$[Presentaciones]@";
"%[Kind]@ is %[Folders]@" = "%1$[Clase]@ es %2$[Carpetas]@";
"%[Kind]@ is %[Applications]@" = "%1$[Clase]@ es %2$[Aplicaciones]@";

/* Search criteria for other kinds of files */
"%[Kind]@ is %[Others...]@ %@" = "%1$[Clase]@ es %2$[Otras…]@ %3$@";

/* Search criteria for files by a particular label (color) */
"%[Label]@ is %@" = "%1$[Etiqueta]@ es %2$@";

/* Search criteria for dates a fixed amount relative to today */
"%[Last Opened]@ %[Any Date]@" = "%1$[Última apertura]@ %2$[Cualquier fecha]@";
"%[Last Modified]@ %[Any Date]@" = "%1$[Última modificación]@ %2$[Cualquier fecha]@";
"%[Created]@ %[Any Date]@" = "%1$[Creado]@ %2$[Cualquier fecha]@";
"%[Last Opened]@ %[Today]@" = "%1$[Última apertura]@ %2$[Hoy]@";
"%[Last Modified]@ %[Today]@" = "%1$[Última modificación]@ %2$[Hoy]@";
"%[Created]@ %[Today]@" = "%1$[Creado]@ %2$[Hoy]@";
"%[Last Opened]@ %[Since Yesterday]@" = "%1$[Última apertura]@ %2$[Desde ayer]@";
"%[Last Modified]@ %[Since Yesterday]@" = "%1$[Última modificación]@ %2$[Desde ayer]@";
"%[Created]@ %[Since Yesterday]@" = "%1$[Creado]@ %2$[Desde ayer]@";
"%[Last Opened]@ %[This week]@" = "%1$[Última apertura]@ %2$[Esta semana]@";
"%[Last Modified]@ %[This week]@" = "%1$[Última modificación]@ %2$[Esta semana]@";
"%[Created]@ %[This week]@" = "%1$[Creado]@ %2$[Esta semana]@";
"%[Last Opened]@ %[Within Last 2 weeks]@" = "%1$[Última apertura]@ %2$[Últimas 2 semanas]@";
"%[Last Modified]@ %[Within Last 2 weeks]@" = "%1$[Última modificación]@ %2$[Últimas 2 semanas]@";
"%[Created]@ %[Within Last 2 weeks]@" = "%1$[Creado]@ %2$[En las dos últimas semanas]@";
"%[Last Opened]@ %[This month]@" = "%1$[Última apertura]@ %2$[Este mes]@";
"%[Last Modified]@ %[This month]@" = "%1$[Última modificación]@ %2$[Este mes]@";
"%[Created]@ %[This month]@" = "%1$[Creado]@ %2$[Este mes]@";
"%[Last Opened]@ %[Within Last 2 months]@" = "%1$[Última apertura]@ %2$[Últimos 2 meses]@";
"%[Last Modified]@ %[Within Last 2 months]@" = "%1$[Última modificación]@ %2$[Últimos 2 meses]@";
"%[Created]@ %[Within Last 2 months]@" = "%1$[Creado]@ %2$[En los dos últimos meses]@";

/* Search criteria for specific dates */
"%[Last Opened]@ %[Exactly]@ %@" = "%1$[Última apertura]@ %2$[Exactamente]@ %3$@";
"%[Last Modified]@ %[Exactly]@ %@" = "%1$[Última modificación]@ %2$[Exactamente]@ %3$@";
"%[Created]@ %[Exactly]@ %@" = "%1$[Creado]@ %2$[Exactamente]@ %3$@";
"%[Last Opened]@ %[Before]@ %@" = "%1$[Última apertura]@ %2$[Antes de]@ %3$@";
"%[Last Modified]@ %[Before]@ %@" = "%1$[Última modificación]@ %2$[antes de]@ %3$@";
"%[Created]@ %[Before]@ %@" = "%1$[Creado]@ %2$[Antes de]@ %3$@";
"%[Last Opened]@ %[After]@ %@" = "%1$[Última apertura]@ %2$[Después de]@ %3$@";
"%[Last Modified]@ %[After]@ %@" = "%1$[Última modificación]@ %2$[después de]@ %3$@";
"%[Created]@ %[After]@ %@" = "%1$[Creado]@ %2$[Después de]@ %3$@";

/* Search criteria for dates a variable amount relative to today */
"%[Last Opened]@ %[Within Last]@ %@ %[Days]@" = "%1$[Última apertura]@ %2$[En los últimos]@ %3$@ %4$[Días]@";
"%[Last Modified]@ %[Within Last]@ %@ %[Days]@" = "%1$[Última modificación]@ %2$[En los últimos]@ %3$@ %4$[Días]@";
"%[Created]@ %[Within Last]@ %@ %[Days]@" = "%1$[Creado]@ %2$[En los últimos]@ %3$@ %4$[Días]@";
"%[Last Opened]@ %[Within Last]@ %@ %[Weeks]@" = "%1$[Última apertura]@ %2$[En las últimas]@ %3$@ %4$[Semanas]@";
"%[Last Modified]@ %[Within Last]@ %@ %[Weeks]@" = "%1$[Última modificación]@ %2$[En las últimas]@ %3$@ %4$[Semanas]@";
"%[Created]@ %[Within Last]@ %@ %[Weeks]@" = "%1$[Creado]@ %2$[En las últimas]@ %3$@ %4$[Semanas]@";
"%[Last Opened]@ %[Within Last]@ %@ %[Months]@" = "%1$[Última apertura]@ %2$[En los últimos]@ %3$@ %4$[Meses]@";
"%[Last Modified]@ %[Within Last]@ %@ %[Months]@" = "%1$[Última modificación]@ %2$[En los últimos]@ %3$@ %4$[Meses]@";
"%[Created]@ %[Within Last]@ %@ %[Months]@" = "%1$[Creado]@ %2$[En los últimos]@ %3$@ %4$[Meses]@";
"%[Last Opened]@ %[Within Last]@ %@ %[Years]@" = "%1$[Última apertura]@ %2$[En los últimos]@ %3$@ %4$[Años]@";
"%[Last Modified]@ %[Within Last]@ %@ %[Years]@" = "%1$[Última modificación]@ %2$[En los últimos]@ %3$@ %4$[Años]@";
"%[Created]@ %[Within Last]@ %@ %[Years]@" = "%1$[Creado]@ %2$[En los últimos]@ %3$@ %4$[Años]@";

/* Search criteria for musical genre type */
"%[Musical genre]@ %@" = "%1$[Género musical]@ %2$@";

/* Search criteria for name extension type */
"%[Name Extension]@ %@" = "%1$[Extensión]@ %2$@";

/* Search criteria for files by name */
"%[Name]@ %[Contains]@ %@" = "%1$[Nombre]@ %2$[Contiene]@ %3$@";
"%[Name]@ %[Begins With]@ %@" = "%1$[Nombre]@ %2$[Empieza por]@ %3$@";
"%[Name]@ %[Ends With]@ %@" = "%1$[Nombre]@ %2$[Termina por]@ %3$@";
"%[Name]@ %[Is]@ %@" = "%1$[Nombre]@ %2$[Es]@ %3$@";

/* Search criteria for other color space properties of a file */
"%[Orientation]@ %[Any Orientation]@" = "%1$[Orientación]@ %2$[Cualquier orientación]@";
"%[Orientation]@ %[Landscape]@" = "%1$[Orientación]@ %2$[Horizontal]@";
"%[Orientation]@ %[Portrait]@" = "%1$[Orientación]@ %2$[Vertical]@";

/* Menu item to bring up an additional list of search criteria */
"%[Other...]@" = "%1$[Otro…]@";

/* Search criteria for raw query type */
"%[Raw query]@ %@" = "%1$[Consulta básica]@ %2$@";

/* Search criteria for generic search-by-all-fields type */
"%[Search for]@ %@" = "%1$[Buscar]@ %2$@";

/* Search criteria for files larger or smaller than a specific number of kilobytes, megabytes, or gigabytes */
"%[Size]@ %[Greater than]@ %@ %[KB]@" = "%1$[Tamaño]@ %2$[Superior a]@ %3$@ %4$[KB]@";
"%[Size]@ %[Less than]@ %@ %[KB]@" = "%1$[Tamaño]@ %2$[Inferior a]@ %3$@ %4$[KB]@";
"%[Size]@ %[Greater than]@ %@ %[MB]@" = "%1$[Tamaño]@ %2$[Superior a]@ %3$@ %4$[MB]@";
"%[Size]@ %[Less than]@ %@ %[MB]@" = "%1$[Tamaño]@ %2$[Inferior a]@ %3$@ %4$[MB]@";
"%[Size]@ %[Greater than]@ %@ %[GB]@" = "%1$[Tamaño]@ %2$[Superior a]@ %3$@ %4$[GB]@";
"%[Size]@ %[Less than]@ %@ %[GB]@" = "%1$[Tamaño]@ %2$[Inferior a]@ %3$@ %4$[GB]@";

/* Search criteria for other visibility properties of a file */
"%[Visibility]@ %[Visible or Invisible]@" = "%1$[Visibilidad]@ %2$[Visible o invisible]@";
"%[Visibility]@ %[Visible Items]@" = "%1$[Visibilidad]@ %2$[Ítems visibles]@";
"%[Visibility]@ %[Invisible Items]@" = "%1$[Visibilidad]@ %2$[Ítems invisibles]@";

